# CannotPutELZInOption Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
BuiltInFailures..::..DesignOptionFailures..::..CannotPutELZInOption Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
Electrical Load Zones must be in the Main Model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPutELZInOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPutELZInOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPutELZInOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace